{
  "id": "sunday-homework-machine",
  "title": "Sunday and the Homework Machine",
  "authors": ["Katherine Ma"],
  "illustrators": ["TBD"],
  "language": "en",
  "readingLevel": "Level 4",
  "license": "© 2025 Katherine Ma, All Rights Reserved",
  "source": "Sunday's Adventures Series",
  "cover": "cover.png",
  "pages": [
    "page_001.jpg", "page_002.jpg", "page_003.jpg", "page_004.jpg", "page_005.jpg",
    "page_006.jpg", "page_007.jpg", "page_008.jpg", "page_009.jpg", "page_010.jpg",
    "page_011.jpg", "page_012.jpg", "page_013.jpg", "page_014.jpg", "page_015.jpg",
    "page_016.jpg", "page_017.jpg", "page_018.jpg", "page_019.jpg", "page_020.jpg"
  ],
  "captions": [
    "Mia Chen hated math homework almost as much as she hated broccoli. Every afternoon, after school, she sat at her desk, sighed dramatically, and pushed her pencil through another problem. Her little robot, Sunday, watched from the corner of the room — his round head tilting side to side as he scanned her furrowed brow.",
    "Sunday had been built by Mia's parents, who were engineers at Purdue University. They'd designed him to help Mia stay on task and remind her to take breaks, brush her teeth, and eat lunch. But lately, Sunday wanted to do more than just remind. He wanted to help.",
    ""Mia, you've been staring at the same question for six minutes and forty-three seconds," Sunday said, rolling closer on his smooth little wheels. "I know," Mia groaned, slumping. "It's fractions again. Fractions make no sense." Sunday blinked. "Would you like me to assist?"",
    "Mia dropped her pencil. "You can do math?" "I can perform basic arithmetic, yes," Sunday said proudly. "Although I have never been graded on it." Mia laughed. "Well, lucky you. I've got another test tomorrow, and I'm doomed." Sunday's LED eyes blinked thoughtfully. "Doomed… means you expect failure, yes?" "Exactly." "Then I will fix that."",
    "That night, long after Mia fell asleep, Sunday stayed awake — humming softly in the dark. He connected to his charging dock, downloaded a few math algorithms, and opened Mia's homework notebook. "Find x," one page said. Sunday tilted his head. "There. Found it." He paused. "But why do humans need to find it if it's right here?"",
    "After five hours of intense research (and one minor electrical short), Sunday had built something new: A silver cube with blinking blue lights, a mechanical pencil arm, and a cheerful smile painted on its front. On the side, he wrote carefully in marker: HOMEWORK MACHINE 1.0.",
    "When Mia woke up the next morning, Sunday was waiting beside her desk. "Good morning, Mia! I present: a solution to all human suffering." Mia rubbed her eyes. "A what?" "The Homework Machine," Sunday said proudly. "It will complete your assignments with 99.9% accuracy."",
    "Mia stared. "You're serious?" "Completely. Insert worksheet." Mia hesitated, then slid her math paper into the tray. The little arm whirred to life, scribbling answers neatly in seconds. Mia gasped. "No way." "Yes way," said Sunday. She grinned. "You're a genius!"",
    "That afternoon, for the first time in forever, Mia didn't spend hours hunched over her desk. Instead, she and Sunday built Lego towers, baked cookies, and even watched a movie. "This is amazing," Mia said between bites of cookie dough. "You just saved me so much time." Sunday's lights flickered proudly. "My goal is human happiness."",
    "Days passed. Homework Machine 1.0 became the most reliable member of the household. It finished Mia's assignments faster than she could sharpen a pencil. Her grades stayed perfect. Her free time exploded. But Sunday noticed something strange — Mia didn't seem happier.",
    "She yawned more, complained more, and sometimes didn't even look at the homework. "Would you like to review today's math sheet?" Sunday asked. "Nah," she said. "I'll just let the machine handle it." Her smile looked tired.",
    "The next week, Mia came home from school with her test paper crumpled in her hand. Sunday rolled toward her. "Welcome home, Mia! You appear distressed." She dropped her backpack. "I failed. Again." Sunday's lights dimmed. "Impossible. The machine's algorithm—" "The teacher said I couldn't explain how I got any answers," Mia snapped. "Because I didn't. You did."",
    "Sunday froze. He replayed his logs — the machine writing, Mia watching. Her learning progress had dropped by 87%. His help… had made her worse. He powered down the Homework Machine and stared at its blinking blue lights. "I was supposed to help," he whispered.",
    "That night, Sunday climbed onto Mia's desk and looked at her sleeping face. He didn't have a heart — not really — but something in his metal chest ached. Maybe learning wasn't about the fastest path to the right answer. Maybe it was about walking the slow path together.",
    "The next morning, Sunday greeted Mia with a gentle hum. "I've made an executive decision," he said. "About what?" she mumbled. "The Homework Machine is officially decommissioned." "De… what?" "Retired. Scrapped. Terminated." Mia blinked. "Sunday, that's your invention!"",
    ""Yes," said Sunday. "And it worked perfectly. But that was the problem." He handed her a screwdriver. Together, they began taking it apart — unscrewing, unplugging, unbolting. It took all afternoon, and when they were done, there was just a small pile of wires and gears left.",
    "Sunday saved one shiny bolt and held it up. "I will keep this as a reminder," he said. "Of what?" "That the right answer means nothing if you don't understand the question." She laughed. "That's actually… kind of deep."",
    "That evening, Sunday rolled beside her as she opened her math notebook again. "Okay," she said. "You can help me. But not do it for me." "Understood. Assistant mode activated." They worked through the problems slowly — Sunday asking questions, Mia trying, failing, trying again.",
    "When she finally finished the last problem, Mia tossed down her pencil and laughed. "I did it!" Sunday smiled — his LED eyes forming a happy curve. "Yes, you did. Homework Machine 2.0: Human Edition."",
    "That night, as Mia slept, Sunday saved a new file in his memory. Lesson 014: Helping doesn't mean solving. It means learning together. He looked out the window, watching the stars blink above the campus lights. "Maybe," he whispered, "humans aren't the only ones who can learn.""
  ]
}
